//----------------------------------------------------------------
#include <iostream>
#include <stdlib.h>
#include <time.h> 
#define size 100

using namespace std;
//----------------------------------------------------------------
int main()

{
setlocale(LC_ALL, "Rus");
int x[size],x2[size],x3[size],xk2[size],col=1,num,i2=0,hig=0,hig2=0;
//---------------------------------------------------------------заполнение главного массива
srand(time(NULL));
for (int i=0;i<=size;i++){
	x[i]=rand()%2;
}
//---------------------------------------------------------------вывод главного массива
cout << "--Получившиеся ряд из "<< size <<" чисел : ";
for (int i=0;i<=size;i++){
	cout << x[i];
}
cout << "\n";
//---------------------------------------------------------------сжатие главного масссива первым способом
for (int i=0;i<size;i++){
	num=x[i];
	x2[i2]=num;
	if (x[i+1]==num){
		col++;
	}
	else{
		x2[++i2]=col;
		hig++;
		i2++;
		col=1;
	}
}
//---------------------------------------------------------------сжатие массива вторым способом
col=1;
i2=0;
for (int i=0;i<size;i++){
	num=x[i];
	x3[i2]=num;
	
	if (x[i+1]==num){
		col++;
	}
	else if (x[i+1]!=num && col==1){
		i2++;
		col=1;
		continue;
	}
	else{
		x3[++i2]=col;
		i2++;
		col=1;
	}
}
//---------------------------------------------------------------вывод массива сжатого первым способом
cout << "\n1.Получившиеся ряд из "<< hig*2 <<" чисел : ";
for (int i=0;i<=(hig*2);i++){
	if(i%2==0){
		cout << "|";
	}
	
	cout << x2[i];
}
cout << "\n";
//---------------------------------------------------------------вывод массива сжатого вторым способом 
cout << "\n2.Получившиеся ряд из "<<i2 <<" чисел : ";
for (int i=0;i<(i2);i++){
	cout << x3[i];
		if((x3[i]!=1 && x3[i]!=0)||(x3[i+2]!=1 && x3[i+2]!=0)){
		cout << "|";
	}
/*			if(x3[i+2]!=1 && x3[i+2]!=0){
		cout << "|";
	}*/
}
//---------------------------------------------------------------разжатие массива сжатого первым способом
for (int i=0,i3,i4=0;i<=(hig*2);i++){
	i3=x2[i+1];
	for (int i2=0;i2<i3;i2++,i4++)
		xk2[i4]=x2[i];
	i++;
}
cout << "\n\n4.Получившиеся ряд из "<< size <<" чисел : ";
for (int i=0;i<=size;i++){	
	cout << xk2[i];
}
//---------------------------------------------------------------конец программы
cout << "\n";
getchar();
return 0;
}
//----------------------------------------------------------------

